**Moodle Database: Educational Data Log Analysis**

Download the database and write an SQL script to count

* the number of tables
* the number of records in each of the tables given in the MIT section
* Number of quiz submissions by hour of day
* Monthly usage time of learners who have confirmed and are not deleted
* Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

Write a python class to pull:
* Overall grade of learners for
* Number of forum posts

MIT tables:
* mdl_logstore_standard_log
* mdl_context
* mdl_user
* mdl_course
* mdl_modules
* mdl_course_modules
* mdl_course_modules_completion
* mdl_grade_items
* mdl_grade_grades
* mdl_grade_categories
* mdl_grade_items_history
* mdl_grade_grades_history
* mdl_grade_categories_history
* mdl_forum
* mdl_forum_discussions
* mdl_forum_posts

In [63]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (7.12.0)
Requirement already satisfied: sqlparse in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: prettytable<1 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (1.3.13)
Requirement already satisfied: six in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (1.14.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.3)
Requirement already satisfied: pygments in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.5.2)
Requirement already satisfied: traitlets>=4.2 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: decorator in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.1)
Requirement already satisfied: backcall in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: jedi>=0.10 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.14.1)
Requirement already satisfied: pickleshare in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (45.2.0.post20200210)
Requirement already satisfied: wcwidth in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.8)
Requirement already satisfied: parso>=0.5.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.2)

In [64]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (2.8.6)

In [65]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (1.3.13)

In [66]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [67]:
import psycopg2

In [68]:
from sqlalchemy import create_engine

In [69]:
# Example format
%sql postgresql://postgres:tije@localhost/10acad_moodle

#### Write an SQL script to count the number of tables

In [70]:
%%sql

SELECT COUNT(*) FROM information_schema.tables

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(636,)]

In [71]:
%%sql

SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = 'public'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(448,)]

#### Write an SQL script to count the number of records in each of the tables given in the MIT section

In [72]:
mit_sesssion = ['mdl_logstore_standard_log', 'mdl_context', 'mdl_user', 'mdl_course', 'mdl_modules',
                'mdl_course_modules', 'mdl_course_modules_completion', 'mdl_grade_items', 'mdl_grade_grades',
                'mdl_grade_categories', 'mdl_grade_items_history', 'mdl_grade_grades_history', 
                'mdl_grade_categories_history', 'mdl_forum', 'mdl_forum_discussions', 'mdl_forum_posts']

In [73]:
for table in mit_sesssion:
    counts = %sql SELECT count(*) as {table}_count from {table}
    display(counts)

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(417554,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(4359,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(1052,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(15,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(26,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(290,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(4483,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(113,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(3643,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(16,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(486,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(7108,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(46,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(34,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(23,)]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(131,)]

#### Write an SQL script to count the Number of quiz submissions by hour of day

In [74]:
%%sql
SELECT * FROM mdl_logstore_standard_log LIMIT 3

 * postgresql://postgres:***@localhost/10acad_moodle
3 rows affected.

[(1, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548311114, 'web', '105.233.48.139', None),
 (2, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548311148, 'web', '105.233.48.139', None),
 (3, '\\core\\event\\dashboard_viewed', 'core', 'viewed', 'dashboard', None, None, 'r', 0, 5, 30, 2, 2, 0, 2, 0, 'N;', 1548311179, 'web', '105.233.48.139', None)]

In [75]:
%%sql

SELECT count(id) AS submission_count, 
  EXTRACT(HOUR FROM to_timestamp(timecreated)) as hour 
    FROM mdl_logstore_standard_log
      WHERE action='submitted' AND component='mod_quiz' group by hour;

 * postgresql://postgres:***@localhost/10acad_moodle
24 rows affected.

[(29, 0.0),
 (7, 1.0),
 (14, 2.0),
 (10, 3.0),
 (18, 4.0),
 (17, 5.0),
 (34, 6.0),
 (46, 7.0),
 (69, 8.0),
 (95, 9.0),
 (88, 10.0),
 (104, 11.0),
 (90, 12.0),
 (80, 13.0),
 (68, 14.0),
 (68, 15.0),
 (70, 16.0),
 (57, 17.0),
 (55, 18.0),
 (46, 19.0),
 (53, 20.0),
 (26, 21.0),
 (23, 22.0),
 (30, 23.0)]

* 11am is the hour with highest submissions
* 1am is the hour with lowest submission.

#### Write an SQL script to count the Monthly usage time of learners who have confirmed and are not deleted

In [76]:
%%sql

SELECT * FROM mdl_user LIMIT 3

 * postgresql://postgres:***@localhost/10acad_moodle
3 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE')]

In [77]:
%%sql

SELECT COUNT(lastaccess - firstaccess) AS number_of_usagetimes,
  EXTRACT (MONTH FROM to_timestamp(firstaccess)) AS month 
    FROM mdl_user WHERE confirmed = 1 AND deleted = 0
      GROUP BY month

 * postgresql://postgres:***@localhost/10acad_moodle
7 rows affected.

[(58, 3.0),
 (31, 7.0),
 (450, 1.0),
 (227, 2.0),
 (27, 6.0),
 (140, 4.0),
 (111, 5.0)]

#### Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [78]:
log_events = ['loggedin', 'viewed', 'started', 'submitted', 'uploaded',
           'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [79]:
# fetch and return count of log events of a give action per user
def event_count(action):
    count = %sql SELECT userid, COUNT(action) AS {action}_count FROM mdl_logstore_standard_log WHERE action='{action}' GROUP BY userid limit 5
    return count
for action in log_events:
    display(event_count(action))

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(1, 1), (2, 169), (3, 107), (5, 54), (7, 3)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(0, 5305), (1, 2), (2, 2492), (3, 4041), (5, 694)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(2, 14), (3, 17), (5, 11), (7, 2), (8, 1)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(2, 21), (3, 2), (5, 5), (9, 8), (16, 1)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(2, 21), (3, 6), (5, 1), (42, 1), (44, 1)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(0, 649), (2, 2551), (3, 1467), (5, 19), (7, 1)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(84, 2), (246, 1), (253, 1), (266, 2), (294, 1)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(3, 4), (5, 2), (9, 1), (25, 10), (39, 4)]

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(5, 2), (9, 4), (25, 6), (38, 1), (39, 1)]

 * postgresql://postgres:***@localhost/10acad_moodle
0 rows affected.

[]

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(2, 5)]

#### Write a python class to pull:

* Overall grade of learners
* Number of forum posts

In [80]:
import pandas as pd
import numpy as np

class Pull():
    
    # create connection
    conn = psycopg2.connect(dbname="10acad_moodle", user="postgres", password="tije")
    
    # grades dataframe
    grade_df = pd.read_sql_query('select * from mdl_grade_grades',con=conn)
    
    # forum posts dataframe
    forum_df = pd.read_sql_query('select * from mdl_forum_posts',con=conn)
    
    # function to get avg grade
    def overall_grade(self):
        
        overall_grade = np.sum(self.grade_df['finalgrade'])
        average_grade = np.mean(self.grade_df['finalgrade'])
        
        print('The Overall Grade Of Learners Is: ', overall_grade)
        print('The Average Overall Grade Of Learners Is: ', average_grade, '\n\n')
     
    # function to get number of forum posts
    def forum_posts(self):
        print('Number Of Users Captured In The Forum Posts Relations:', self.forum_df.userid.nunique())
        print('The Number Of Forum Posts Is:', self.forum_df['id'].nunique())

In [81]:
import pandas as pd
import numpy as np

pull = Pull()
pull.overall_grade()
pull.forum_posts()

The Overall Grade Of Learners Is:  231922.91028999997
The Average Overall Grade Of Learners Is:  107.37171772685176


Number Of Users Captured In The Forum Posts Relations: 70
The Number Of Forum Posts Is: 131

**Task 2 - Data Extraction Transformation and Loading (ETL)**

Based on task 1, write a python class to perform the following:
* Compute dedication time
* Compute login and activity counts.
* Based on the following metrics, group students as top 1%, 5%, 10%, 25%
 * Login count
 * Activity count
 * Dedication time

Dedication time of a learner is the time between login and last activity for that login session, which is the last activity before the next login event for a given learner.  For more information, check these references. 
Moodle estimates time based in the concepts of Session and Session duration applied to Moodle's log entries:

* Click: every time that a user accesses a page in Moodle a log entry is stored.
* Session: set of two or more consecutive clicks in which the elapsed time between every pair of consecutive clicks does not overcome an established maximum time.
* Session duration: elapsed time between the first and the last click of the session.

In [61]:
class Dedication_Time:
        
    # create connection
    def __init__(self, database = '10acad_moodle', user = 'postgres', password = 'tije'):
        self.database = database
        self.user = user
        self.password = password
        self.conn = psycopg2.connect(host="localhost", port = 5432, database=self.database, user=self.user, password=self.password)
        
    def get_table(self):
        table = pd.read_sql_query("select * from mdl_logstore_standard_log", con=self.conn)
        return table
        
    def get_dedication_time(self, user):
        table = self.table
        
        df = table.loc[table.userid == user]
        df_logins = df.loc[df.action == 'loggedin']
        df_others = df.loc[df.action != 'loggedin']

        login_stamps = df_logins.timecreated.to_list()
        other_stamps = df_others.timecreated.to_list()
        
        latest_time = max(other_stamps) #ultimate last event (last event for last login session)

        last_events = []
        for i in range(1,len(login_stamps)):
            try:
                latest_before_login = max(dt for dt in other_stamps if dt < login_stamps[i])
#                 last_events.append(latest_before_login)  # this is gonna be a list for last events for the first n-1 login sessions
            except Exception:
                latest_before_login = login_stamps[i-1] # when there're no other events
            last_events.append(latest_before_login)

        latest_event = [latest_time]
        last_events = last_events + latest_event
        
        times = []
        for i,j in zip(last_events, login_stamps):
            diff = i - j
            diff = diff if diff < 7200 else 7200  # limit the dedication time to a maximum of 7200secs per session
            times.append(diff)

        try:
            user_dedication_total = sum(times)
            user_dedication_total = user_dedication_total if user_dedication_total >= 0 else 0 
        except Exception: #in cases where users have no login events
            user_dedication_total = 0
        
        return user_dedication_total
    
    def reconstruct_table(self, totals_list):
        user_ids = activity.userid.unique().tolist()
        dedication_time_totals = totals_list
        df = pd.DataFrame(columns = ['userid', 'dedication_time'])
        df['userid'] = user_ids
        df['dedication_time'] = dedication_time_totals
        
        self.conn.close()

        
        return df

In [62]:
d = Dedication()
activity = d.get_table()

dedication_totals = []
for user in activity.userid.unique().tolist():
    total = d.get_dedication_time(user)
    dedication_totals.append(total)
    
len(dedication_totals)

AttributeError: 'Dedication' object has no attribute 'activity'

* Compute login and activity counts.
* Based on the following metrics, group students as top 1%, 5%, 10%, 25%
  * Login count
  * Activity count
  * Dedication time